{
  "albums": [
    {
      "id": "all-these-are-the-days",
      "year": 2016,
      "title": "All These Are The Days",
      "cover": "assets/images/album_covers/01_album_cover.png",
      "process": "An experimental album using tape cassette degradation as a primary technique, manipulating the tape to create saturation and distortion.This process results in a deliberately broken, imperfect sound that highlights the beauty of analog decay.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/all-these-are-the-days"
    },
    {
      "id": "the-field-of-living",
      "year": 2016,
      "title": "The Field of Living",
      "cover": "assets/images/album_covers/02_album_cover.png",
      "process": "Combining household objects to create melodies and ambiances alongside instrumental music, this album blends organic and experimental elements, capturing a raw, unrefined sonic experience.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/the-field-of-living"
    },
    {
      "id": "sun-and-ice",
      "year": 2017,
      "title": "Sun & Ice",
      "cover": "assets/images/album_covers/03_album_cover.png",
      "process": "Emphasizing field recordings, this album creates an atmospheric backdrop for instrumental music. The integration of location-based sounds with composed elements sets a context for the music, offering a narrative that connects sound to environment.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/sun-ice"
    },
    {
      "id": "the-after-mountain",
      "year": 2020,
      "title": "The After Mountain",
      "cover": "assets/images/album_covers/04_album_cover.png",
      "process": "This album features cyclical re-amping of spatialized audio to generate complex, organic textures. The audio is re-spatialized in a 5-speaker setup and recorded binaurally. Physical movement is embedded within the layers as the recordings evolve.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/the-after-mountain"
    },
    {
      "id": "waiting-spaces",
      "year": 2020,
      "title": "Waiting Spaces",
      "cover": "assets/images/album_covers/05_album_cover.png",
      "process": "Focused on reamping sound through unconventional objects like underwater and metallic structures, this album examines how physical mediums can transform and reshape audio, creating a rich sonic landscape filled with texture and depth.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/waiting-spaces"
    },
    {
      "id": "wanderlust-ii",
      "year": 2021,
      "title": "Wanderlust II",
      "cover": "assets/images/album_covers/06_album_cover.png",
      "process": "An album that integrates tape loops, hydrophones, and binaural recordings to evoke a sense of place and immersion. These elements combine to create an acoustic journey, blending natural and synthetic sounds while exploring the boundaries between environment and sound.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/wanderlust-ii"
    },
    {
      "id": "timelines",
      "year": 2023,
      "title": "Timelines",
      "cover": "assets/images/album_covers/08_album_cover.png",
      "process": "This album explores the process of cyclical re-amping, where sounds are linked to specific spaces and played back repeatedly. The resulting audio is manipulated through multiple iterations, creating a layered composition that captures the unique sonic character of each space.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/timelines"
    }
  ]
}