{
  "albums": [
    {
      "id": "all-these-are-the-days",
      "year": 2016,
      "title": "All These Are The Days",
      "cover": "assets/images/album_covers/01_album_cover.png",
      "process": "An experimental album using tape cassette degradation as a primary technique, manipulating the tape to create saturation and distortion. This process results in a deliberately broken, imperfect sound that highlights the beauty of analog decay.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/all-these-are-the-days"
    },
    {
      "id": "the-field-of-living",
      "year": 2016,
      "title": "The Field of Living",
      "cover": "assets/images/album_covers/02_album_cover.png",
      "process": "Combining household objects to create melodies and ambiances alongside instrumental music, this album blends organic and experimental elements, capturing a raw, unrefined sonic experience.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/the-field-of-living"
    },
    {
      "id": "sun-and-ice",
      "year": 2017,
      "title": "Sun & Ice",
      "cover": "assets/images/album_covers/03_album_cover.png",
      "process": "Emphasizing field recordings, this album creates an atmospheric backdrop for instrumental music. The integration of location-based sounds with composed elements sets a context for the music, offering a narrative that connects sound to environment.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/sun-ice"
    },
    {
      "id": "the-after-mountain",
      "year": 2020,
      "title": "The After Mountain",
      "cover": "assets/images/album_covers/04_album_cover.png",
      "process": "The After Mountain was recorded at 5430a between October 2019 and February 2020. It is in continuation with the musical triptych published in 2016-2017. This album was made with immersive spatialization in mind. Sound textures were moved across a room using 6 speakers placed in a circle and captured with a binaural microphone at the center. A person who listens with headphones will feel as if they are surrounded by moving sounds creating enveloping soundscapes. Each piece is minimalist, repetitive, immersive and slowly evolving in the micro details. The work is meant to be listened in its entirety as each piece merges into the other.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/the-after-mountain"
    },
    {
      "id": "waiting-spaces",
      "year": 2020,
      "title": "Waiting Spaces",
      "cover": "assets/images/album_covers/05_album_cover.png",
      "process": "Waiting Spaces was recorded at 6751 and 1960 between May & August 2020. It is in continuation with The After Mountain. Textures were created from upright and grand piano through modular synthesis, digital processing and physical movement. On this EP, drums are nonexistent or so very far in the background, more like a subconscious pulse. Binaural microphones were used to create a 3D audio space around the listener. Headphones are recommended for spatiality.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/waiting-spaces"
    },
    {
      "id": "wanderlust-ii",
      "year": 2021,
      "title": "Wanderlust II",
      "cover": "assets/images/album_covers/06_album_cover.png",
      "process": "Wanderlust II was recorded between January & December 2021 at 6751 & 7203. It is in continuation with all previous works. In this album, I imagined myself revisiting different rooms, which represent different time frames from the past. I pictured spaces that do not physically make sense, spaces where the areas overlap each other, fade into another and collapse on themselves. Each layer of sound was viewed as a universe of its own, a room in a room constantly shifting between which one contains the other. I reference many pieces from my previous releases. The intent was to merge previous works the same way memories condense themselves after time. The closing piece was recreated from the EP Sun & Ice to emphasize this recurring desire: Wanderlust.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/wanderlust-ii"
    },
    {
      "id": "timelines",
      "year": 2023,
      "title": "Timelines",
      "cover": "assets/images/album_covers/08_album_cover.png",
      "process": "TIMELINES was recorded between January 16th and 24th 2023, at the Banff Center for Arts and Creativity, in room E148. Recorded over 8 days, this music was created from different iterations of a same sound. Grand piano manipulated through electronic processing was recorded and reintroduced into the space at varying speeds and pitches. I intertwined additional piano lines into these new textures, repeating the process cyclically. Minimalist drumming and imperfections from my movement in the room were layered along the way. The ambient sounds of fellow artists creating in the adjacent rooms bled through the walls, subtly infiltrating the recordings, adding another layer of artifacts. This album is about a personal shift in perception, a subtle but profound alteration of timelines.",
      "bandcamp": "https://maysunmusic.bandcamp.com/album/timelines"
    }
  ]
}