{
  "bio": [
    "Etienne Mason, known professionally as MAYSUN, is a composer and sound artist whose work transforms physical spaces into immersive sound environments.",
    "Centered around modular systems, DIY electronics, and cyclical processing, MAYSUN develops adaptable sound structures that interact with and reshape the contexts they inhabit. Blurring the lines between site-responsive installations and performance, his practice creates moments where sound, the room, and the listener become inseparable.",
    "MAYSUN has served on the Board of Directors of the Canadian Electroacoustic Community (CEC) since 2023. He completed a 2024 ITP/IMA Fellowship at New York University, participated in the New Amsterdam Composers Lab, was awarded a 2025-2026 microgrant from Rhizome and is currently a mentor at NEW INC."
  ],
  "statement": [
    "Instruments that listen.",
    "MAYSUN explores how spatial audio, environmental sound, technology, and emotional resonance combine to create immersive experiences.",
    // "Working with modular systems, custom electronics, and site-responsive installations, he develops adaptable sound environments through cyclical processing. This method records space, feeds it back through effects and physical materials, then layers those recordings into evolving structures. His approach is grounded in self-taught methods emphasizing direct material engagement and sustained momentum through daily practice.",
    // "His work resists traditional music industry formats, prioritizing experience and process over fixed products. Forever In Sound, his living archive, reflects this commitment to process as the work itself.",
    // "His current focus involves developing portable and scalable spatial sound systems that make immersive audio accessible in any space, treating the room as an instrument and the audience as part of the sound.",
    "Working with custom electronics and distributed processing, I create spatial audio systems that treat the room as a sound source. Microphones capture ambient sound, movement, conversation, silence. That audio is processed through granular effects, time manipulation, and feedback circuits, then redistributed through the space. The room hears itself and responds.",
    "My systems are portable and site-specific. Instead of bringing all equipment, I use whatever amplification is available. Guitar amps, PA systems, portable speakers. Each one contributes its own character to the sonic ecology. No two installations sound the same because no two spaces are the same.",
    "This approach emerged from years of touring, recording spaces, and processing audio through physical environments. I learned that the most interesting sounds come from letting the space participate. My role is to build the conditions for that participation.",
    "Current work involves Distributed Listener System, a network of wireless processors that can be deployed anywhere. Each unit listens independently, processes locally, and outputs to its own amplification. Together they create immersive environments that respond to whoever and whatever is present."
  ]
}