{
  "bio": [
    "Etienne Mason, known professionally as MAYSUN, is a composer and sound artist whose work transforms physical spaces into immersive sound environments.",
    "Centered around modular systems, DIY electronics, and cyclical processing, MAYSUN develops adaptable sound structures that interact with and reshape the contexts they inhabit. Blurring the lines between site-responsive installations and performance, his practice creates moments where sound, the room, and the listener become inseparable.",
    "MAYSUN has served on the Board of Directors of the Canadian Electroacoustic Community (CEC) since 2023. He completed a 2024 ITP/IMA Fellowship at New York University, participated in the New Amsterdam Composers Lab, was awarded a 2025-2026 microgrant from Rhizome and is currently a mentor at NEW INC."
  ],
  "statement": [
    "Instruments that listen.",
    "MAYSUN explores how spatial audio, environmental sound, technology, and emotional resonance combine to create immersive experiences.",
    "Working with custom electronics and distributed processing, he creates spatial audio systems that treat the room as a sound source. Microphones capture ambient sound, movement, conversation, silence. That audio is processed through granular effects, time manipulation, and feedback circuits, then redistributed through the space. The room hears itself and responds.",
    "His systems are portable and site-specific. Each element contributes its own character to the sound ecology. No two installations sound the same as no two spaces are the same.",
    "This approach emerged from years of touring, recording spaces, and processing audio through physical environments. The most interesting sounds come from letting the space participate. His role is to build the conditions for that participation.",
    "Current focus involves Distributed Listener System, a network of wireless processors that can be deployed in any space. Each unit listens independently, processes locally, and outputs to its own amplification. Together they create immersive environments that respond to what is present."
  ]
}