[
  {
    "id": "dls",
    "title": "Distributed Listener System",
    "type": "instrument",
    "year": "2026",
    "url": "dls.html",
    "main_image": "assets/images/diy_devices/dls/main_dls_1600w.jpg",
    "short_description": "Distributed Listener System is a portable spatial performance instrument composed of a wireless controller and multiple Listeners. The controller sends states, processing instructions, or sequences wirelessly to each Listener. It transmits no audio.\n\nEach Listener runs two processors. One receives the control signal, the other captures and processes audio locally. The Listeners do not share a sound source. Each one hears the room from its own perspective.\n\nBecause each Listener captures sound from a different point of view, none of them receive the exact same signal. At the same time, because they occupy the same architectural space, they respond to the same sonic environment. What is distributed is not the sound itself, but the processing. This creates the perception of sound moving through space.\n\nBy placing Listeners across a room or between connected spaces, architecture becomes part of the signal path.\n\nOne Listener or many. The system is scalable and portable.",
    "back_story": "The system extends from my studio practice of routing sound through physical environments, recording the result, and feeding it back into the same space. I built CYCL to replicate that cyclical process live using a microphone as its primary sound source. Distributed Listener expands this logic across multiple spaces. Instead of a single instrument hearing the room, several independent nodes capture different points of view within the same architectural container. The room feeds back into itself, and the processing moves wirelessly through space.",
    "components_tx": [
      "ESP32 WROOM-32E",
      "OLED screen 0.96\"",
      "6 switches",
      "2 potentiometers",
      "2 momentary switches",
      "1 on/off switch",
      "5V buck converter",
      "Barrel connector",
      "Recycled aluminum enclosure with wood panel"
    ],
    "components_rx": [
      "XIAO SEEED ESP32-S3",
      "Daisy Seed",
      "MAX9814 microphone",
      "OPA1652 op-amp",
      "2 potentiometers",
      "3-position switch",
      "XLR/1/4\" dual jack input",
      "Stereo 1/4\" output",
      "Barrel connector",
      "Buck converter",
      "Oak and acrylic enclosure (hand-built from reclaimed materials)"
    ],
    "gallery": [
      "assets/images/diy_devices/dls/bts01_dls_900h.jpg",
      "assets/images/diy_devices/dls/bts02_dls_900h.jpg",
      "assets/images/diy_devices/dls/bts03_dls_900h.jpg",
      "assets/images/diy_devices/dls/bts04_dls_900h.jpg",
      "assets/images/diy_devices/dls/bts05_dls_900h.jpg"
    ]
  },
  {
    "id": "cycl",
    "title": "CYCL",
    "type": "instrument",
    "year": "2025",
    "url": "cycl.html",
    "main_image": "assets/images/diy_devices/cycl/main_synth_1600w.jpg",
    "short_description": "This instrument creates soundscapes from surrounding sounds. It listens to and processes nearby musicians, audience chatter, movement, room acoustics, and other audible activity. Because it hears the space and returns sound back into the room, it produces successive iterations of that space over time. Each pass feeds into the next, forming cycles in which the room itself functions as the source. The signal path starts from the built-in microphone and is routed into either a dry path, a beat-repeat processor, or a looper.<br><br>These paths are then recombined and sent into a combination of four effects:<ul><li><strong>SunCrystals:</strong> chaotic granular processing with pitch-shift and feedback</li><li><strong>High Shifter:</strong> granular processing based on +1 and +2 octave logic</li><li><strong>Low Shifter:</strong> granular processing based on −1 and −2 octave logic</li><li><strong>SunGrain:</strong> a chopping effect that imposes rhythmic structure on incoming sound</li></ul>After this stage, the signal can continue to the output, or a snapshot can be captured and looped at half speed, creating a new source that can be routed back through the effects chain. This process can be repeated indefinitely, producing sounds that range from dark ambient textures to glitch-driven electronic material and tape-degradation–style soundscapes.<br><br>An 8×8 LED matrix display provides real-time visual feedback, indicating the active effect, CPU load, loop lengths, beat-repeat speeds, SunGrain tempo, per-effect gain, and input and output meters.",
    "back_story": "After years of using physical space as part of my recording process, I began looking for a way to reconnect with space in a live context, and to reamp sound through a room in real time. I had moved through many setups, including hardware synths, modular systems, samplers, and working entirely in a DAW, but none of them allowed this process to happen simply or directly in performance. I designed this instrument to be a portable, self-contained way to work with space live, without relying on external gear. It replaces the typical chain of microphone, interface, computer, DAW, and cabling, making it easier to improvise and collaborate.",
    "future": "For V2, the focus is on consolidating the design. This includes creating a custom PCB and adding a secondary output for additional routing possibilities.",
    "components": [
      "Daisy Seed Microcontroller",
      "MAX9814 Microphone",
      "DotStar 8×8 LED matrix",
      "10 Momentary Switches",
      "2 Encoders",
      "6 Potentiometers",
      "1 Toggle Switch",
      "1 Power Switch",
      "5v Regulator",
      "1/8\" mono input jack",
      "1/8\" stereo output jack",
      "Found Wood",
      "Recycled Acrylic Sheet"
    ],
    "gallery": [
      "assets/images/diy_devices/cycl/bts01_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts02_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts03_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts04_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts05_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts06_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts07_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts08_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts09_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts10_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts11_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts12_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts13_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts14_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts15_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts16_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts17_synth_900h.jpg",
      "assets/images/diy_devices/cycl/bts18_synth_900h.jpg"
    ]
  },
  {
    "id": "node-1",
    "title": "NODE-1",
    "type": "instrument",
    "year": "2025",
    "url": "node-1.html",
    "main_image": "assets/images/diy_devices/node-1/main_node1_1600w.jpg",
    "short_description": "Node-1 is a wall-mounted listening device. It captures ambient room sound such as voices, footsteps, and movement, and transforms it using granular textures and layered delays. It shifts through different internal states over a 30-minute cycle. A stabilizing synth voice plays slow chords that change qualities every few minutes, helping anchor the space when feedback becomes intense.",
    "back_story": "Node-1 is the foundation for CYCL. I was looking for a way to shape room sound into soundscapes. Reactive, but also generative. With multiple nodes, any space becomes a spatial listening system.",
    "future": "This is the first step of a bigger project. To be continued...",
    "components": [
      "Daisy Seed microcontroller",
      "MAX9814 microphone preamp",
      "LED indicator",
      "1/8\" mono output jack",
      "recycled acrylic sheet"
    ],
    "gallery": [
      "assets/images/diy_devices/node-1/bts01_node1_900h.jpg",
      "assets/images/diy_devices/node-1/bts02_node1_900h.jpg",
      "assets/images/diy_devices/node-1/bts03_node1_900h.jpg",
      "assets/images/diy_devices/node-1/bts04_node1_900h.jpg"
    ]
  },
  {
    "id": "cymbal_controller",
    "title": "CYMBAL CONTROLLER",
    "type": "instrument",
    "year": "2024",
    "url": "cymbal_controller.html",
    "main_image": "assets/images/diy_devices/gyro/main_gyro_1600w.jpg",
    "short_description": "This device uses a Teensy 4.1 and MPU9250 to turn cymbal motion into 4 continuous MIDI CC signals (Y+, Y–, X+, X–), allowing real-time control of spatialization, textures, and other effects. The unit recalibrates its center when still, includes switches to mute CC channels for easier mapping in Ableton, and features a sensitivity knob for scaling data. It appears as USB-Device to any DAW. Paired with a hand-hammered steel cymbal from a previous DIY project, the system enables tactile, gesture-based modulation while performing.",
    "back_story": "I wanted a more tactile way to control sound. Something portable, expressive, and performable. Using only a cymbal and a laptop, I could shape spatial textures and effects from an acoustic source in real time. This paired naturally with a steel cymbal I shaped and hand-hammered in 2021, turning it into both an acoustic and electronic instrument.",
    "future": "Future versions will focus on improved stability, including more consistent calibration behavior and refined motion filtering for smoother control.",
    "components": [
      "Teensy 4.1 microcontroller",
      "MPU9250 gyroscope/accelerometer",
      "4 toggle switches",
      "1 potentiometer",
      "1 button",
      "B-stock maple",
      "recycled acrylic sheet",
      "velcro mount"
    ],
    "gallery": [
      "assets/images/diy_devices/gyro/bts01_gyro_900h.jpg",
      "assets/images/diy_devices/gyro/bts02_gyro_900h.jpg",
      "assets/images/diy_devices/gyro/bts03_gyro_900h.jpg",
      "assets/images/diy_devices/gyro/bts04_gyro_900h.jpg",
      "assets/images/diy_devices/gyro/bts05_gyro_900h.jpg",
      "assets/images/diy_devices/gyro/bts06_gyro_900h.jpg",
      "assets/images/diy_devices/gyro/bts07_gyro_900h.jpg"
    ]
  }
]